<?php
namespace App\common\Controller;

class baseController
{
    private static $status = [
        '0'     => 'success',
        '10001' => 'failed',
        '10002' => '未知错误',
        '10003' => '系统维修中，请稍后再试',

        '20001' => '递交的信息不齐全',
        '20002' => '递交的信息不安全',

        '30001' => '不用重复修改',
        '30002' => '不用重复添加',
        '30003' => '已超过数额限制',
        '30004' => '信息不唯一',

        '40001' => '旧密码错误',
        '40002' => '新密码与旧密码一样',
        '40003' => '新密码与确认密码不一致',
        '40004' => '密码长度不符合规定',

        '50001' => '已登录',
        '50002' => '未登录',
        '50003' => '与登录信息不符、未登录或已失效',
        '50004' => '标识符错误',


    ];
}